taha27/microprocessor-systems-proj/g-20/rtos-integration/Lab4_STM32F4Cube_Base_project/Sources/Thread_LED.c
/*******************************************************************************
  * @file    Thread_LED.c
  * @author  Ashraf Suyyagh
	* @version V1.0.0
  * @date    17-January-2016
  * @brief   This file initializes one LED as an output, implements the LED thread 
  *					 which toggles and LED, and function which creates and starts the thread	
  ******************************************************************************
  */
	
#include "cmsis_os.h"
#include "stm32f4xx_hal.h"

void Thread_LED(void const *argument);
void TextOut(const char *str);
osThreadId tid_Thread_LED;
osThreadDef(Thread_LED, osPriorityNormal, 1, 0);
GPIO_InitTypeDef LED_configuration;

int start_Thread_LED(void){

  tid_Thread_LED = osThreadCreate(osThread(Thread_LED ), NULL); // Start LED_Thread
  if (!tid_Thread_LED) return(-1); 
  return(0);
}

void Thread_LED(void const *argument){
	
	while(1){
		osDelay(1000);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
		printf("works\n\r");
	}
}

void initializeLED_IO (void){

	__HAL_RCC_GPIOD_CLK_ENABLE();

	LED_configuration.Pin		= GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
	LED_configuration.Mode 	= GPIO_MODE_OUTPUT_PP;
	LED_configuration.Speed	= GPIO_SPEED_FREQ_VERY_HIGH;
	LED_configuration.Pull	= GPIO_NOPULL;
	HAL_GPIO_Init(GPIOD, &LED_configuration);	
}
	
/* void TextOut(const char *str)
{
  do {
    if(*str=='\n') ITM_SendChar('\r');
    ITM_SendChar(*str);
  } while(*str++);
} */
	
